"""
range(stop)  # Один аргумент
range(5) -> [0, 1, 2, 3, 4]
range(7) -> [0, 1, 2, 3, 4, 5, 6]


range(start, stop)  # Два аргумента
range(2, 5) -> [2, 3, 4]
range(3, 7) -> [3, 4, 5, 6]

range(7, 2) -> []  # Пустой список


range(start, stop, step)  # Три аргумента
range(3, 10, 2) -> [3, 5, 7, 9]
range(3, 10, 3) -> [3, 6, 9]

range(10, 2, -1) -> [10, 9, 8, 7, 6, 5, 4, 3]
range(10, 2, -2) -> [10, 8, 6, 4]

Алгоритм:
1) Высчитываем следующее число (если оно первое, то берем start)
2) Сравниваем его с stop
    Если step > 0, то знак сравнения БОЛЬШЕ
    Если step < 0, то знак сравнения МЕНЬШЕ
3) Если сравнение ИСТИНА, то добавляем число в список


"""

for i in range(5):
    print('Здесь был Вася')

print('====================')
print('range(5, 10)')
for i in range(5, 10):
    print(i)

print('====================')
print('range(5, 10, 2)')
for i in range(5, 10, 2):
    print(i)

print('====================')
print('range(10, 3, -2)')
for i in range(10, 2, -2):
    print(i)

