"""
Поработать со списками
Создать пустой, с элементами
Добавить элемент в список
Получить эл из списка
Перезаписать элемент в списке


Поработать со словарями
Создать пустой, с элементами
Добавить элемент в словарь
Получить эл из словаря
Перезаписать элемент в словаре
"""

print('Задание')
